; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-17)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 roomb)
(at ball8 roomb)
(at ball9 roomb)
(at ball10 roomb)
(at ball11 room3)
(at ball12 room3)
(at ball13 room4)
(at ball14 room4)
(at ball15 room4)
(at ball16 room4)
(at ball17 room4)
(at-robby rooma)
)
(:goal
(and
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 roomb)
(at ball7 roomb)
(at ball8 room3)
(at ball9 room3)
(at ball10 room3)
(at ball11 room3)
(at ball12 room3)
(at ball13 room3)
(at ball14 room3)
(at ball15 room4)
(at ball16 room4)
(at ball17 room4)
)
)
)

; plan
1. (pick ball6 rooma left)
   deleted: (at ball6 rooma) (free left)
   added: (carry ball6 left)
   goals met: 11 of 17
2. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 11 of 17
3. (drop ball6 roomb left)
   deleted: (carry ball6 left)
   added: (at ball6 roomb) (free left)
   goals met: 12 of 17
4. (pick ball9 roomb right)
   deleted: (at ball9 roomb) (free right)
   added: (carry ball9 right)
   goals met: 12 of 17
5. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 12 of 17
6. (drop ball9 room3 right)
   deleted: (carry ball9 right)
   added: (at ball9 room3) (free right)
   goals met: 13 of 17
7. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 13 of 17
8. (pick ball8 roomb left)
   deleted: (at ball8 roomb) (free left)
   added: (carry ball8 left)
   goals met: 13 of 17
9. (pick ball10 roomb right)
   deleted: (at ball10 roomb) (free right)
   added: (carry ball10 right)
   goals met: 13 of 17
10. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 13 of 17
11. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 13 of 17
12. (drop ball10 room3 right)
   deleted: (carry ball10 right)
   added: (at ball10 room3) (free right)
   goals met: 14 of 17
13. (drop ball8 room3 left)
   deleted: (carry ball8 left)
   added: (at ball8 room3) (free left)
   goals met: 15 of 17
14. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 15 of 17
15. (pick ball14 room4 left)
   deleted: (at ball14 room4) (free left)
   added: (carry ball14 left)
   goals met: 15 of 17
16. (pick ball13 room4 right)
   deleted: (at ball13 room4) (free right)
   added: (carry ball13 right)
   goals met: 15 of 17
17. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 15 of 17
18. (drop ball14 room3 left)
   deleted: (carry ball14 left)
   added: (at ball14 room3) (free left)
   goals met: 16 of 17
19. (drop ball13 room3 right)
   deleted: (carry ball13 right)
   added: (at ball13 room3) (free right)
   goals met: 17 of 17
